documents/images/graphio/stdlib/convert_color4_surfaceshader.dot
digraph {
  rankdir = LR;
    NG_convert_color4_surfaceshader_surface [label= "surface_unlit"];
    NG_convert_color4_surfaceshader_surface[shape = box];
    NG_convert_color4_surfaceshader_surface ->     NG_convert_color4_surfaceshader_out;
    NG_convert_color4_surfaceshader_out [label= "out"];
    NG_convert_color4_surfaceshader_out[shape = box]; 
    NG_convert_color4_surfaceshader_convert [label= "convert"];
    NG_convert_color4_surfaceshader_convert[shape = box];
    NG_convert_color4_surfaceshader_convert ->     NG_convert_color4_surfaceshader_surface [label= "emission_color"];
    NG_convert_color4_surfaceshader_surface [label= "surface_unlit"];
    NG_convert_color4_surfaceshader_surface[shape = box]; 
    NG_convert_color4_surfaceshader_inINT [label="in"];
    NG_convert_color4_surfaceshader_inINT [shape = ellipse];
    NG_convert_color4_surfaceshader_convert [label="convert"];
    NG_convert_color4_surfaceshader_inINT -> NG_convert_color4_surfaceshader_convert [label=".in"];
    NG_convert_color4_surfaceshader_extract [label= "extract"];
    NG_convert_color4_surfaceshader_extract[shape = box];
    NG_convert_color4_surfaceshader_extract ->     NG_convert_color4_surfaceshader_surface [label= "opacity"];
    NG_convert_color4_surfaceshader_surface [label= "surface_unlit"];
    NG_convert_color4_surfaceshader_surface[shape = box]; 
    NG_convert_color4_surfaceshader_inINT [label="in"];
    NG_convert_color4_surfaceshader_inINT [shape = ellipse];
    NG_convert_color4_surfaceshader_extract [label="extract"];
    NG_convert_color4_surfaceshader_inINT -> NG_convert_color4_surfaceshader_extract [label=".in"];
}
